n=[1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
for a in n : # выводим значения из списка в а и сравниваем как тлько значения превышают список не регестрирует значения
    if a<5:
        print(a)
#Есть список n = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
#Выведите все элементы, которые меньше 5.