#Выведите первый и последний элемент списка.
d={}
s=[]
s=input()
s=s.split()
d=list(s)
print(d[:1],d[-1:])